In [1]:
import pandas as pd

# Questions on "titles.csv" file

In [2]:
titles = pd.read_csv('C:/Users/dell/Documents/ML Training/OneDrive-2024-06-20/titles.csv')
titles.head()

                          title  year
0                    El plebeyo  1953
1  Atoski vrtovi - preobrazenje  1989
2                Mateegy norkos  2006
3                 Lanka Dahanam  1936
4                       Acciaio  1933

## How many movies are listed in the titles dataframe?

In [3]:
titles.shape[0]

226013

## What are the earliest two films listed in the titles dataframe?

In [4]:
titles.sort_values('year').head(2)

                     title  year
104859          Miss Jerry  1894
218352  The Startled Lover  1898

## How many movies have the single-word title "Hamlet"?

In [5]:
titles[titles['title'] == "Hamlet"].shape[0]

20

In [6]:
titles[titles['title'] == "Hamlet"].count()

title    20
year     20
dtype: int64

In [7]:
len(titles[titles['title'] == "Hamlet"])

20

In [8]:
titles[titles['title'] == "Hamlet"].count

<bound method DataFrame.count of          title  year
5103    Hamlet  1910
12003   Hamlet  1996
13749   Hamlet  1987
29426   Hamlet  2014
37979   Hamlet  1976
40775   Hamlet  2017
50554   Hamlet  1921
56379   Hamlet  1948
66654   Hamlet  1990
111648  Hamlet  1973
115763  Hamlet  2000
131005  Hamlet  1954
132387  Hamlet  2011
136491  Hamlet  2016
138703  Hamlet  1969
171280  Hamlet  1913
189874  Hamlet  2015
198468  Hamlet  1964
198763  Hamlet  1911
207508  Hamlet  2009>

## How many movies are titled "North by Northwest"?

In [9]:
titles[titles["title"] == "North by Northwest"].shape[0]

1

## When was the first movie titled "Hamlet" made?

In [10]:
titles[titles['title'] == 'Hamlet'].sort_values('year').head(1)

       title  year
5103  Hamlet  1910

In [11]:
# in case if you only want year
titles[titles['title'] == 'Hamlet'].sort_values('year').head(1)['year']

5103    1910
Name: year, dtype: int64

## List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
titles[titles['title'] == 'Treasure Island'].sort_values('year')

                  title  year
37707   Treasure Island  1918
125462  Treasure Island  1920
177104  Treasure Island  1934
177713  Treasure Island  1950
166628  Treasure Island  1972
40833   Treasure Island  1973
181472  Treasure Island  1985
30150   Treasure Island  1999

## How many movies were made in the year 1950?

In [13]:
titles[titles['year'] == 1950].shape[0]

1109

## How many movies were made in the year 1960?

In [14]:
titles[titles['year'] == 1960].shape[0]

1496

## How many movies were made from 1950 through 1959?

In [15]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].shape[0]

12664

## In what years has a movie titled "Batman" been released?

In [16]:
titles[titles['title'] == 'Batman']

         title  year
164979  Batman  1989
191293  Batman  1943

In [17]:
titles[titles['title'] == 'Batman']['year']

164979    1989
191293    1943
Name: year, dtype: int64

In [18]:
titles['year'][titles['title'] == 'Batman']

164979    1989
191293    1943
Name: year, dtype: int64

In [19]:
# in case you want list of years for Batman movie release

batman = titles[titles['title'] == 'Batman']
batman_release_years = batman['year'].tolist()
print(batman_release_years)

# we can also do this
titles[titles['title'] == 'Batman']['year'].tolist()

[1989, 1943]

[1989, 1943]

#  Questions on "cast.csv" file

In [20]:
cast = pd.read_csv('C:/Users/dell/Documents/ML Training/OneDrive-2024-06-20/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

## How many roles were there in the movie "Inception"?

In [21]:
cast[cast['title'] == 'Inception'].shape[0]

78

## How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [22]:
cast[(cast['title'] == 'Inception') & (cast['n'].isna() == True)].shape[0]

27

In [23]:
# another way
cast[cast['title'] == 'Inception']['n'].isnull().sum()

27

## But how many roles in the movie "Inception" did receive an "n" value?

In [24]:
cast[(cast['title'] == 'Inception') & (cast['n'].isna() == False)].shape[0]

51

In [25]:
# we can also use notna()
cast[(cast['title'] == 'Inception') & (cast['n'].notna() == True)].shape[0]

51

In [26]:
cast[cast['title'] == 'Inception']['n'].notnull().sum()

51

# Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [27]:
cast[(cast['title'] == 'North by Northwest') & (cast['n'].notna() == True)].sort_values('n')

,title,year,name,type,character,n
797150,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3201980,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1333732,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2878461,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
326415,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2780220,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1551491,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1167105,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2239203,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1657968,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
609229,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2100440,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
425645,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1379980,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
189719,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1267109,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

## Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [28]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 1972)].sort_values('n')

,title,year,name,type,character,n
1560814,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
299291,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
342151,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1341313,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2490141,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1325945,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

## Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [29]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 2007)].sort_values('n')

          title  year                 name     type          character    n
299292   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1183659  Sleuth  2007             Jude Law    actor               Milo  2.0
1652936  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
238747   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
342152   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2490140  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3069393  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

## How many roles were credited in the silent 1921 version of Hamlet?

In [30]:
c = cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)]
len(c)

9

## How many roles were credited in Branagh’s 1996 Hamlet?

In [46]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)])

54

## How many "Hamlet" roles have been listed in all film credits through history?

In [50]:
cast[(cast['character'] == 'Hamlet')].name.unique().shape[0]

93

## How many people have played an "Ophelia"?

In [49]:
cast[cast['character'] == 'Ophelia'].name.unique().shape[0]

101

## How many people have played a role called "The Dude"?

In [51]:
cast[cast['character'] == 'The Dude'].name.unique().shape[0]

17

## How many people have played a role called "The Stranger"?

In [52]:
cast[cast['character'] == 'The Stranger'].name.unique().shape[0]

160

## How many roles has Sidney Poitier played throughout his career?

In [53]:
len(cast[cast['name'] == 'Sidney Poitier'])

43

## How many roles has Judi Dench played?

In [54]:
len(cast[cast['name'] == 'Judi Dench'])

55

## How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [38]:
c = cast[(cast['year'] >= 1980) & (cast['year'] <= 1989)]
c['n'].isnull().sum()

49404

## List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [39]:
cast[(cast['name'] == 'Cary Grant') & (cast.year // 10 == 194) & (cast['n'] == 2)].sort_values('year')

                   title  year        name   type    character    n
797147  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
797157    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

In [40]:
cg = cast[cast['name'] == 'Cary Grant']
cg = cg[cg['n'] == 2]
cg = cg[cg.year // 10 == 194]
cg.sort_values('year')

                   title  year        name   type    character    n
797147  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
797157    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

## List the leading roles that Cary Grant played in the 1940s in order by year.

In [41]:
cast[(cast['name'] == 'Cary Grant') & (cast.year // 10 == 194) & (cast['n'] == 1)].sort_values('year')

,title,year,name,type,character,n
797172,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
797131,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
797174,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
797162,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
797176,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
797153,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
797122,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
797146,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
797154,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
797114,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
797149,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
797148,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
797151,Notorious,1946,Cary Grant,actor,Devlin,1.0
797168,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
797169,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
797145,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
797126,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
797135,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

## How many roles were available for actors in the 1950s?

In [42]:
a = cast
a = a[a['type'] == 'actor']
a = a[a.year // 10 == 195]
len(a)

153559

## How many leading roles (n=1) were available from the beginning of film history through 1980?

In [56]:
r = cast
r = r[r.year <= 1980]
r = r[r['n'] == 1]
len(r)

62763

## How many non-leading roles were available through from the beginning of film history through 1980?

In [58]:
r2 = cast
r2 = r2[r2.year <= 1980]
r2 = r2[r2['n'] != 1]
len(r2)

1078306

## How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [59]:
r3 = cast
r3 = r3[r3.year <= 1980]
r3 = r3[r3['n'].isnull() == True]
len(r3)

437383